In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
my_data = np.random.randint(1,101,5)

In [4]:
my_index = ['shivansh','dhruv','shreyash','anish','gaurav']

In [5]:
my_series = pd.Series(data = my_data,index = my_index)

In [7]:
my_series

shivansh    22
dhruv       37
shreyash    50
anish       77
gaurav       4
dtype: int32

In [8]:
my_dict = {'shivansh':43,'shreyash':56,'Anish':34,'Gaurav':89}

In [9]:
my_series_dict = pd.Series(my_dict)

In [10]:
my_series_dict

shivansh    43
shreyash    56
Anish       34
Gaurav      89
dtype: int64

In [11]:
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}

In [12]:
sales_q1 = pd.Series(q1)

In [13]:
sales_q2 = pd.Series(q2)

In [14]:
sales_q1['Japan']

80

In [16]:
sales_q1[0]

80

In [18]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [20]:
sales_q1*2

Japan    160
China    900
India    400
USA      500
dtype: int64

In [22]:
sales_q2/100

Brazil    1.0
China     5.0
India     2.1
USA       2.6
dtype: float64

In [24]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [26]:
sales_q1.add(sales_q2,fill_value = 0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [27]:
my_data = np.random.randint(0,101,(4,3))

In [28]:
my_rows = ['Shivansh','Gaurav','Shreyash','Anish']

In [29]:
my_coloumns = ['ages','gender','class']

In [35]:
df = pd.DataFrame(data = my_data,index = my_rows,columns = my_coloumns)

In [36]:
df

          ages  gender  class
Shivansh    34      97     98
Gaurav      70      92     64
Shreyash    34      24     44
Anish       35      16     23

In [39]:
pd.read_csv('tips.csv')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672